from flask.app import Flask


def register_note_module_blue(app: Flask):
    """
    注册 Note 模块的蓝图
    """
    from app.controller.note.ImgBlue import register_blue_Img

    register_blue_Img(app)


#################################################################################################################################################################################################
#################################################################################################################################################################################################
#################################################################################################################################################################################################

def forward_note_error(error: TypeError):
    """
    转发 Note 模块的错误
    """
    from app.controller.note.ErrorHandler import register_note_error_handler
    return register_note_error_handler(error)
